Repository: 1823616178/uwpsshtool
Catalog: src/SshTool.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# KeyImport_ErrReadFailed
source: File read failed: {0}
zh_cn: 文件读取失败：{0}

# KeyGenerate_ErrFallback
source: Generation failed, try again
zh_cn: 生成失败，请重试

# Main_ToolsItem.Label
source: Tools & settings
zh_cn: 工具与设置

# Main_PlaceholderNewHost
source: New host
zh_cn: 新建主机

# Main_PlaceholderSync
source: Sync
zh_cn: 同步

# Tools_PageHeader.Title
source: Tools & settings
zh_cn: 工具与设置

# Tools_RowSettings.Title
source: Settings
zh_cn: 设置

# Tools_RowSettings.Subtitle
source: Appearance, terminal, keyboard, connection, diagnostics
zh_cn: 外观、终端、键盘、连接与诊断

# Tools_RowKeys.Title
source: Keys
zh_cn: 密钥

# Tools_RowKeys.Subtitle
source: Import, generate and export public keys
zh_cn: 导入、生成与导出公钥

# Tools_RowSnippets.Title
source: Snippets
zh_cn: 命令片段

# Tools_RowSnippets.Subtitle
source: Send frequently used commands
zh_cn: 常用命令一键发送

# Tools_RowAppearance.Title
source: Terminal appearance
zh_cn: 终端外观

# Tools_RowAppearance.Subtitle
source: Colors, font and cursor
zh_cn: 配色、字体与光标

# Tools_RowKnownHosts.Title
source: Known hosts
zh_cn: 已知主机

# Tools_RowKnownHosts.Subtitle
source: Trusted host fingerprints
zh_cn: 已信任的主机指纹

# Tools_RowGroups.Title
source: Host groups
zh_cn: 主机分组

# Tools_RowGroups.Subtitle
source: Create, rename and reorder groups
zh_cn: 新建、重命名与排序分组

# Terminal_MenuFind
source: Find
zh_cn: 查找

# Terminal_MenuOpenLink
source: Open link
zh_cn: 打开链接

# Terminal_MenuCopyLink
source: Copy link
zh_cn: 复制链接

# Terminal_FindBox.PlaceholderText
source: Find in output
zh_cn: 在输出中查找

# Terminal_FindNone
source: No matches
zh_cn: 无结果

# Hosts_SectionFavorites
source: Favorites
zh_cn: 收藏

# Hosts_SectionRecent
source: Recent
zh_cn: 最近

# Hosts_SectionUngrouped
source: Ungrouped
zh_cn: 未分组

# HostRow_MenuFavorite.Text
source: Add to favorites
zh_cn: 收藏

# HostRow_MenuFavoriteText
source: Add to favorites
zh_cn: 收藏

# HostRow_MenuUnfavorite
source: Remove from favorites
zh_cn: 取消收藏

# HostRow_MenuPin.Text
source: Pin to Start
zh_cn: 固定到开始屏幕

# Settings_Terminal_Bell.Header
source: Terminal bell
zh_cn: 终端响铃

# Settings_Terminal_Bell_Vibrate
source: Vibrate
zh_cn: 振动

# Settings_Terminal_Bell_Visual
source: Flash screen
zh_cn: 闪屏

# Settings_Terminal_Bell_None
source: Off
zh_cn: 无

# Settings_Connection_NotifyDisconnect.Header
source: Notify when disconnected in background
zh_cn: 后台断线时通知

# Settings_Security_AppLock.Header
source: App lock
zh_cn: 应用锁

# Settings_Security_AppLock_Note.Text
source: Require Windows Hello or PIN on launch and after being away for more than 1 minute
zh_cn: 启动或离开应用超过 1 分钟后，需通过 Windows Hello 或 PIN 验证

# Settings_Security_AppLock_Unavailable
source: Set up a PIN or Windows Hello on this device to use app lock
zh_cn: 此设备未设置 PIN 或 Windows Hello，无法启用应用锁

# Settings_Security_AppLock_Confirm
source: Verify your identity to turn on app lock
zh_cn: 验证身份以启用应用锁

# AppLock_Title
source: Lumia SSH is locked
zh_cn: Lumia SSH 已锁定

# AppLock_Unlock
source: Unlock
zh_cn: 解锁

# AppLock_Prompt
source: Verify your identity to unlock Lumia SSH
zh_cn: 验证身份以解锁 Lumia SSH

# Notify_DisconnectTitle
source: Connection lost
zh_cn: 连接已断开

# Notify_DisconnectBody
source: Session "{0}" was disconnected. Tap to return.
zh_cn: 「{0}」的会话已断开，点按返回

# Sftp_RowDownloadToFolder
source: Download to folder…
zh_cn: 下载到文件夹…

# Sftp_RowOpenWith
source: Open with another app
zh_cn: 用其他应用打开

# Sftp_BookmarkAdd
source: Bookmark this folder
zh_cn: 收藏此目录

# Sftp_BookmarkRemove
source: Remove bookmark
zh_cn: 取消收藏此目录

# Sftp_Bookmarks
source: Bookmarks
zh_cn: 书签

# Sftp_BookmarkAdded
source: Folder bookmarked
zh_cn: 已收藏此目录

# Share_PageHeader.Title
source: Upload to Lumia SSH
zh_cn: 上传到 Lumia SSH

# Share_DoneButton.Content
source: Done
zh_cn: 完成

# Share_Received
source: Received {0} file(s). Open Lumia SSH and pick a host to upload.
zh_cn: 已收到 {0} 个文件。打开 Lumia SSH，选择主机即可上传。

# Share_Nothing
source: Nothing to upload (folders are not supported).
zh_cn: 没有可上传的文件（不支持文件夹）。

# Share_PickHostTitle
source: Upload shared files to…
zh_cn: 上传分享的文件到…

# Share_Later
source: Later
zh_cn: 稍后

# Share_Discard
source: Discard
zh_cn: 丢弃

# Tools_RowImportConfig.Title
source: Import from ssh_config
zh_cn: 从 ssh_config 导入

# Tools_RowImportConfig.Subtitle
source: Add hosts from an OpenSSH config file
zh_cn: 读取 OpenSSH 配置文件批量添加主机

# Tools_ImportTitle
source: Import ssh_config
zh_cn: 导入 ssh_config

# Tools_ImportReadFailed
source: Could not read the file. Make sure it is UTF-8 text.
zh_cn: 无法读取该文件，请确认它是 UTF-8 文本。

# Tools_ImportSummary
source: {0} host(s) will be imported. Skipped: {1} duplicate, {2} without User, {3} wildcard pattern.
zh_cn: 将导入 {0} 台主机。跳过：重名 {1}、缺少 User {2}、通配符模式 {3}。

# Tools_ImportNeedsKey
source: {0} of them use IdentityFile: private keys are not imported. Import them under Keys and link them in the host editor.
zh_cn: 其中 {0} 台配置了 IdentityFile：私钥不会导入，请在「密钥」中导入后到主机编辑页关联。

# Tools_ImportConfirm
source: Import
zh_cn: 导入

# Terminal_MenuImeOn
source: Switch to IME input (Chinese)
zh_cn: 切换为中文输入（输入法）

# Terminal_MenuImeOff
source: Switch to direct English input
zh_cn: 切换为英文直通输入

# Sftp_ViewOptionsButton.Label
source: Sort & view
zh_cn: 排序与视图

# Common_LoadFailed
source: Loading failed
zh_cn: 加载失败

# Common_Retry
source: Retry
zh_cn: 重试

# Common_ClearSearch
source: Clear search
zh_cn: 清除搜索

# Common_BrowseHosts
source: Browse hosts
zh_cn: 查看主机

# Sftp_ReadingDirectory
source: Reading directory…
zh_cn: 正在读取目录…

# Sftp_Deleting
source: Deleting…
zh_cn: 正在删除…

# Sftp_Renaming
source: Renaming…
zh_cn: 正在重命名…

# Sftp_CreatingDirectory
source: Creating directory…
zh_cn: 正在创建目录…

# Sftp_ChangingPermissions
source: Updating permissions…
zh_cn: 正在更新权限…

# Sftp_EmptyUpload
source: Upload files
zh_cn: 上传文件

# Snippets_NoMatches_Description
source: No command snippets match your search.
zh_cn: 没有找到符合搜索条件的命令片段。

# KnownHosts_EmptyTitle
source: No known hosts
zh_cn: 暂无已知主机

# KnownHosts_EmptyDescription
source: Host key fingerprints will be recorded here after successful SSH connections.
zh_cn: 首次成功连接 SSH 主机会在此记录主机密钥指纹。

# KnownHosts_NoMatchesTitle
source: No matching host fingerprints
zh_cn: 没有匹配的主机指纹

# AppearanceList_EmptyTitle
source: No appearance schemes
zh_cn: 没有配色方案

# AppearanceList_EmptyDescription
source: Create custom color schemes for your terminal.
zh_cn: 创建自定义配色方案，打造专属终端风格。

# AppearanceList_EmptyPrimary
source: New Scheme
zh_cn: 新建配色

# GroupManage_EmptyTitle
source: No groups
zh_cn: 暂无分组

# GroupManage_EmptyDescription
source: Create groups to organize hosts with custom colors.
zh_cn: 创建分组整理主机，支持自定义名称和强调色。
